Documents/абс_СтратегическиеЦелиПродаж/абс_СтратегическиеЦелиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СтратегическиеЦелиПродаж</name>
  <registerRecords>InformationRegister.абс_СтратегическиеЦелиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.абс_ЦелиПродаж</registerRecords>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапСогласования</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньСогласования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставПлана</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТочекПродаж</name>
      <comment>Общее количество точек продаж</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АКБ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоАртикулов</name>
      <comment>Среднее количество артикулов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Территория</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Канал</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоЧисленнойДистрибуции</name>
      <comment>Общее количество точек в которых есть хотя бы одна позиция марки Леовит</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоДистрибуцииФА1</name>
      <comment>Количество точек содержащих фокусный ассортимент 1 уровня</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоДистрибуцииФА2</name>
      <comment>Количество точек содержащих фокусный ассортимент 2 уровня</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоДистрибуцииФА3</name>
      <comment>Количество точек содержащих фокусный ассортимент 3 уровня</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоДистрибуцииФА4</name>
      <comment>Количество точек содержащих фокусный ассортимент 4 уровня</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_СтратегическиеЦелиПродаж/Forms/ФормаЗагрузки/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Загрузка = ПолучитьТаблицуПоДокументу();
			
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Оповестить("абс_СтратегическиеЦелиПродаж_ЗагрузкаИзEXCEL", Загрузка);
	Закрыть();
		
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПоДокументу() Экспорт
	
	обОбъект = РеквизитФормыВЗначение("Объект");
	дПериодПланирования = обОбъект.ДатаПланирования;
	
	Макет = Документы.абс_СтратегическиеЦелиПродаж.ПолучитьМакет("ЗагрузкаEXCEL");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	ОбластьШапкаРегион 	= Макет.ПолучитьОбласть("Шапка|Регион");
	ОбластьШапкаПериод 	= Макет.ПолучитьОбласть("Шапка|Период");
	ОбластьСтрокаРегион = Макет.ПолучитьОбласть("Строка|Регион");
	ОбластьСтрокаПериод = Макет.ПолучитьОбласть("Строка|Период");
	
	//нарисуем шапку
	ТабДок.Вывести(ОбластьШапкаРегион);
	
	ТекМесяц = НачалоГода(дПериодПланирования);
	Пока ТекМесяц <= КонецГода(дПериодПланирования) Цикл
		ОбластьШапкаПериод.Параметры.Период = ТекМесяц;		
		ТабДок.Присоединить(ОбластьШапкаПериод);		
		ТекМесяц = ДобавитьМесяц(ТекМесяц, 1);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(абс_СтратегическиеЦелиПродажСоставПлана.Период, МЕСЯЦ) КАК Период,
		|	абс_СтратегическиеЦелиПродажСоставПлана.Регион КАК Регион,
		|	абс_СтратегическиеЦелиПродажСоставПлана.Территория КАК Территория,
		|	абс_СтратегическиеЦелиПродажСоставПлана.Город КАК Город,
		|	абс_СтратегическиеЦелиПродажСоставПлана.Канал КАК Канал,
		|	абс_СтратегическиеЦелиПродажСоставПлана.ЦельПоЧисленнойДистрибуции КАК ЦельПоЧисленнойДистрибуции,
		|	абс_СтратегическиеЦелиПродажСоставПлана.ЦельПоДистрибуцииФА1 КАК ЦельПоДистрибуцииФА1,
		|	абс_СтратегическиеЦелиПродажСоставПлана.ЦельПоДистрибуцииФА2 КАК ЦельПоДистрибуцииФА2,
		|	абс_СтратегическиеЦелиПродажСоставПлана.ЦельПоДистрибуцииФА3 КАК ЦельПоДистрибуцииФА3,
		|	абс_СтратегическиеЦелиПродажСоставПлана.ЦельПоДистрибуцииФА4 КАК ЦельПоДистрибуцииФА4
		|ИЗ
		|	Документ.абс_СтратегическиеЦелиПродаж.СоставПлана КАК абс_СтратегическиеЦелиПродажСоставПлана
		|ГДЕ
		|	абс_СтратегическиеЦелиПродажСоставПлана.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регион,
		|	Период
		|ИТОГИ
		|	СУММА(ЦельПоЧисленнойДистрибуции),
		|	СУММА(ЦельПоДистрибуцииФА1),
		|	СУММА(ЦельПоДистрибуцииФА2),
		|	СУММА(ЦельПоДистрибуцииФА3),
		|	СУММА(ЦельПоДистрибуцииФА4)
		|ПО
		|	Регион,
		|	Период ПЕРИОДАМИ(МЕСЯЦ, &НачПериода, &КонПериода),
		|	Территория,
		|	Город,
		|	Канал";

	Запрос.УстановитьПараметр("Ссылка", обОбъект.Ссылка);
	Запрос.УстановитьПараметр("НачПериода", НачалоГода(дПериодПланирования));
	Запрос.УстановитьПараметр("КонПериода", КонецГода(дПериодПланирования));

	Результат = Запрос.Выполнить();

	ВыборкаРегион = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаРегион.Следующий() Цикл
		// Вставить обработку выборки ВыборкаРегион
		ОбластьСтрокаРегион.Параметры.Регион 		= ВыборкаРегион.Регион;
		ОбластьСтрокаРегион.Параметры.Территория 	= ВыборкаРегион.Территория;
		ОбластьСтрокаРегион.Параметры.Город 		= ВыборкаРегион.Город;
		ОбластьСтрокаРегион.Параметры.Канал			= ВыборкаРегион.Канал;
		
 		ТабДок.Вывести(ОбластьСтрокаРегион);

		ВыборкаПериод = ВыборкаРегион.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");

		Пока ВыборкаПериод.Следующий() Цикл
			ОбластьСтрокаПериод.Параметры.Заполнить(ВыборкаПериод);
	 		ТабДок.Присоединить(ОбластьСтрокаПериод);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
